{
  "title": "NYC Health Hospitals 2024 Doyle Award: Revolutionizing Patient Care Through Tech",
  "summary": "NYC Health Hospitals received the 2024 Doyle Award for integrating innovative technology to improve patient care, leveraging digital tools and advanced data analytics.",
  "sourceUrl": "https://www.mcg.com/client-resources/news-item/nyc-health-hospitals-2024-doyle-award/",
  "content": "NYC Health + Hospitals (NYC H+H), the largest municipal public hospital system in the U.S., undertook a tech-enabled process improvement to address a costly operational problem: insurance claim denials for inpatient care. Hospital executives and clinical leaders formed a project team that leveraged an evidence-based clinical decision support system (MCG Health guidelines software) and revamped internal workflows to improve documentation of medical necessity. Over a two-year initiative, the team introduced disease-specific documentation alerts in the electronic health record for high-denial diagnoses (e.g. chest pain, sepsis) and created standardized templates to help physicians capture the required data. They also rolled out comprehensive staff training and leadership-driven accountability measures – including full-day retreats with physicians, nurses, case managers, and finance staff to educate them on best practices, and even a friendly competition by sharing performance data across the system's 11 hospitals to spur improvement. Leadership Strategies: This effort was championed by senior leadership as a top priority for financial sustainability and quality. Key strategies included: Cross-departmental collaboration: The initiative brought together clinical leaders (in emergency, internal medicine, surgery), utilization management experts, and finance/revenue cycle teams, breaking down silos. Hospital CEOs and medical directors were engaged to support changes in their facilities. Use of data and technology: Leaders implemented the MCG clinical criteria software to provide real-time decision support. They closely monitored denial rates data and fed back results to each hospital, fostering a data-driven culture. Education and culture change: By organizing system-wide training retreats and sharing success stories, leadership fostered buy-in. The competition aspect (publishing each hospital's improvements) created positive peer pressure and shared ownership of results. Impact: The results were striking. In two years, NYC H+H cut its inpatient claim denial rate by 50%, translating to an annual savings of about $50 million in recovered revenue. This improvement earned the health system a national award for innovation in healthcare leadership. More importantly, reducing unnecessary denials meant patients faced fewer care disruptions – fewer cases of needed hospital stays being initially unpaid or challenged by insurers. Clinical documentation quality improved, which has a ripple effect on patient safety and continuity (ensuring that severity of illness is properly recorded). The efficiency gains also free up financial resources that can be reinvested in patient care services. Challenges & Solutions: Initially, clinicians were resistant to extra documentation steps, and there was skepticism about involving non-clinical criteria software in care decisions. Leadership tackled this by clearly communicating the patient-care rationale (proper documentation ensures patients aren't denied necessary care) and by demonstrating respect for clinical judgment – the software was framed as a tool to support clinicians with evidence-based criteria. They also incentivized compliance by showing how improved documentation led to fewer administrative headaches (like less back-and-forth with insurers). Another challenge was system complexity across 11 public hospitals. This was overcome by strong central leadership coordination and local champions at each site. Regular progress meetings and the friendly inter-hospital competition kept momentum. Ultimately, the project's success – measurable in dollars saved and denial rates dropped – helped overcome any lingering doubts, as staff saw tangible rewards for their efforts"
}
